import React from "react";
import panorama_1 from "../pictures/pic_13.jpg";
import panorama_2 from "../pictures/panorama_2.JPG";

function History() {
  return (
    <div className="m-4 p-4 rounded home">
      <div className="d-flex flex-column justify-content-center">
        <h1 className="mb-5 text-center">История</h1>
        <p>
          <img
            src={panorama_2}
            alt="Stefanovo"
            width="440"
            height="247"
            className="float-end"
          />
          В 1944 година село Проваленица се слива със селото Горни Раковец и
          образуват днешното Стефаново.[2] Според речника на селищата на Николай
          Мичев и Петър Коледаров селата са сляти с указ на 13 декември 1955.[3]
        </p>
        <p>
          Село Стефаново има богата история. Наличните данни сочат за
          съществуване на интензивен селищен живот в миналото, особено през
          античността. В селското землище са регистрирани две антични селища,
          две антични вили и множество могили. Едното антично селище, което
          впечатлява със значителните си размери от около 100 дка, е разположено
          в очертанията на предишното село Горни Раковец, в местността „Мали
          рид“. От него са разкривани стени, изградени от ломен камък и тухли с
          хоросанова и калова спойка. В същата местност е открита бронзова
          статуя, накити и много монети. Предполага се, че оттук произхожда и
          оброчната плочка на Хера (II – III в.) от с. Проваленица, съхранявана
          в Националния археологически музей. Останките от другото антично
          селище, което е продължило съществуванието си и през късната античност
          (IV-VI в.) са разкрити в м. „Кръсто“, на около 1,5 км южно от селото.
          Въз основа на пръснати из терена археологически материали се
          предполага, че неговата площ е била около 15 дка. И на това място в
          миналото са разкривани части от зидове, карамични съдове, монети и др.
        </p>

        <div>
          <img
            src={panorama_1}
            alt="Stefanovo"
            width="400"
            height="225"
            className="float-start p-2"
          />
          <p>
            Едната антична вила рустика е разкрита при прокопаване на канал край
            махалата Егреците. Стените ѝ са изградени от ломен камък и тухли на
            хоросанова спойка. Сред руинити ѝ са разкрити хипокауст (подово
            отопление) и водопровод. Около вилата се среща изобилие от
            строителна и битова керамика, пръсната на площ от около 15 дка. В
            непосредствена близост има две надгробни могили, които несъмнено са
            нейно притежание.
          </p>
          <p>
            Другата вила е разкрита в североизточния район на селото, в
            Дюлгерска махала. В дворовете и нивите в западна посока, на площ от
            около 15 дка, се намират археологически материали от монументално
            антично строителство. За размерите и представителността на вилата
            говорят разкрити фрагменти от колони и две бази с различни размери –
            едната с диаметър 0,45 м, а другата с диаметър 0,28 м. Вероятно с
            тази вила е била свързана с една доста голяма могила, върху която
            през XIX в. е изградена селската черква. В непосредствена близост до
            могилата са разкривани стени, по всяка вероятност останали от зидани
            гробници, изградени вторично в могилния насип и около него.
          </p>

          <p>
            Не е известно дали описаните антични и късноантични селища имат пряк
            приемник в по-късен период, но със сигурност е установено, че
            съставните селища на днешното Стефаново – Горни Раковец и
            Проваленица имат средновековен произход.
          </p>
          <p>
            Първият писмен запис на селата намираме в османски данъчни документи
            от XV в, в които са записани под същото име – Проваленича и Ракофче.
            В обширния тимарски опис на Кюстендилски санджак от 1570/73 г. са
            вписани като Проваленица и Горни Раковец към каза Радомир. По това
            време първото село има: 63 християнски семейства, 58 неженени, 5
            вдовици и 9 бащинѝ (общо около 350 жители); а второто: 42
            християнски семейства, 25 неженени, 3 вдовици и 5 бащинѝ (общо около
            250 жители). Селото се среща под същото име и в списъците на
            джелепкешаните (овцевъдите) от 1576 г.
          </p>
          <p>
            От така представената информация разбираме, че двете села са
            населени изцяло с християни и са сравнително многолюдни. Наличието
            на бащинѝ (общо 14 в двете села) се отъждествява с присъствието на
            войнуци – немюсюлмани на служба в османската войска, който ползват
            известни привилегии, включително и данъчни облекчения. Последното
            обстоятелство позволява акумулиране на средства, както за
            допълнителна стопанска дейност, така и за дарения и благоустрояване
            на местните културни институции (черкви, манастири и др.). Тази
            зависимост се потвърждава от значителния брой християнски култови
            паметници в района на Проваленица и Раковец.
          </p>
          <p>
            Именно тези християнски храмове, някои от тях достигнали до нас в
            руинно състояние, като оброчища или само като имена на местности,
            категорично свидетелстват за поддържаните вяра и национален дух през
            вековете на османско робство.
          </p>
        </div>
      </div>
    </div>
  );
}

export default History;
